app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-08-22 22:28:49.914721"], ["updated_at", "2018-08-22 22:28:49.914721"]]
---
	def create
	  @class = SchoolClass.new(class_params(:title, :room_number))
	  @class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2018-08-22 22:35:23.351399"], ["id", 1]]
---
	def update
	  @class = SchoolClass.find(params[:id])
	  @class.update(class_params(:title))