app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-08-22 22:28:49.948635"], ["updated_at", "2018-08-22 22:28:49.948635"]]
---
	def create
	  @student = Student.new(student_params(:title, :description))
	  @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["updated_at", "2018-08-22 22:35:23.490773"], ["id", 1]]
---
	def update
	  @student = Student.find(params[:id])
	  @student.update(student_params(:title))